gdgly/NUC97X_JS/STM32F4xx/DL698/Menu_2_ParametersSetting.c

//菜单2 终端参数设置
#include "Project698.h"
#include "../Display/Display.h"
#include "Menu.h"
#include "../Device/MEMRW.h"
#include "../Calculate/Calculate.h"
#include "../STM32F4xx/STM32F4xx_RTC.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/RTC.h"
#include "../DL698/DL698_DataDef.h"

extern u64 Get_TSA_BY_PN(u32 Pn);//根据配置序号，得到TSA。不包含数据类型。
extern const u8 UnitList[][6];//通用单位列表
extern const u8 ProtocolList[][13];

#if ((Project/100)==2)//集中器

const u8 pMenu2_2[]=//集中器参数设置与查看
{
	"参数设置与查看\n\r"
	"  1.通信通道设置\n\r"
	"  2.电表参数设置\n\r"
	"  3.集中器时间设置\n\r"
	"  4.界面密码设置\n\r"
	"  5.集中器编号\n\r"
};
#endif
#if ((Project/100)==3)//专变

const u8 pMenu2_2[]=//集中器参数设置与查看
{
	"参数设置与查看\n\r"
	"  1.通信通道设置\n\r"
	"  2.电表参数设置\n\r"
	"  3.终端时间设置\n\r"
	"  4.界面密码设置\n\r"
	"  5.终端编号\n\r"
};
#endif

const u8 pMenu2_2_1[]=
{
	"  1.无线公网设置\n\r"
	"  2.以太网设置\n\r"
};
const u8 pMenu2_2_2[]=
{
	"电能表参数设置\n\r"
	"配置序号\n\r"
	"波特率\n\r"
	"通信端口\n\r"
	"通信规约\n\r"
	"地址\n\r"
	"费率数\n\r"
	"接线方式\n\r"
	"采集器\n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_3[]=
{
	"时间设置\n\r"
	"日期:\n\r"
	"时间:\n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_5[]=
{
	"通信地址设置\n\r"
	"地址\n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_4[]=
{
	"菜单密码\n\r"
	"密码:\n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_1_1[]=
{
	"无线公网设置\n\r"
	"  1.通信模式设置\n\r"
	"  2.侦听端口设置\n\r"
	"  3.主站通信参数设置\n\r"
	"  4.APN设置\n\r"
	"  5.用户名设置\n\r"
	"  6.密码设置\n\r"
};

const u8 pMenu2_2_1_1_1[]=
{
	"通信模式设置\n\r"
	"工作模式:\n\r"
	"在线方式:\n\r"
	"连接方式:\n\r"
	"应用方式:\n\r"
	"超时时间:\n\r"
	"重发次数:\n\r"
	"心跳周期:\n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_1_1_2[]=
{
	"侦听端口设置\n\r"
	"侦听端口:\n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_1_1_3[]=
{
	"主站IP及端口设置\n\r"
	"主IP:\n\r"
	"主端口:\n\r"
	"备IP:\n\r"
	"备端口:\n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_1_2[]=
{
	"以太网设置\n\r"
	"  1.通信配置\n\r"
	"  2.侦听端口设置\n\r"
	"  3.主站通信参数设置\n\r"
	"  4.终端IP设置\n\r"
	"  5.PPPoE用户名设置\n\r"
	"  6.PPPoE密码设置\n\r"
	"  7.MAC地址设置\n\r"
};

const u8 pMenu2_2_1_2_1[]=
{
	"通信配置\n\r"
	"工作模式:\n\r"
	"连接方式:\n\r"
	"应用方式:\n\r"
	"超时时间:\n\r"
	"重发次数:\n\r"
	"心跳周期:\n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_1_2_4[]=
{
	"终端IP设置\n\r"
	"类型:\n\r"
	"IP  :\n\r"
	"子网:\n\r"
	"网关:\n\r"
	"      确认设置\n\r"
};


const u8 pMenu2_2_1_2_6[]=
{
	"MAC地址设置\n\r"
	"  1.十进制\n\r"
	"  2.十六进制\n\r"
};

const u8 pMenu2_2_1_2_6_1[]=
{
	"MAC地址设置\n\r"
	"MAC:\n\r"
	" \n\r"
	"      确认设置\n\r"
};

const u8 pMenu2_2_1_2_6_2[]=
{
	"MAC地址设置\n\r"
	"MAC\n\r"
	"      确认设置\n\r"
};

const u8 IpTypeList[][7]=//IP类型列表
{
	"DHCP ",//0
	"静态 ",//1
	"PPPoE",//2
};




const u8 OnlineModeList[][9]=//在线模式列表
{
	"永久在线", //0
	"被动激活", //1
};

const u8 WorkModeList[][7]=//工作模式列表
{
	"混合  ",   //0
	"客户机", //1
	"服务器", //2
};

const u8 ConnectList[][4]=//连接方式列表
{
	"TCP",   //0
	"UDP",   //1
};

const u8 ApplicationList[][7]=//连接方式列表
{
	"主备  ",   //0
	"多连接",   //1
};

const u8 CommunicationSpeedList[][7]=//通信速率列表
{
	"300   ",      //0
	"600   ",     //1
	"1200  ",     //2
	"2400  ",     //3
	"4800  ",     //4
	"7200  ",     //5
	"9600  ",     //6
	"19200 ",     //7
	"38400 ",     //8
	"57600 ",     //9
	"115200",    //10
	"自适应",    //255
};


const u8 PortList[][13]=//通信协议列表
{
	"未知        ",//0 
	"交采        ",
	"485-1       ",
	"485-2       ",
	"载波        ",
};

const u8 ConnectType[][9]=//接线方式
{
	"未知    ",
	"单相    ",
	"三相三线",
	"三相四线"
};

const u8 default_6000[]={0x02,0x04,
						0x12,0x00,0x00,
						0x02,0x0a,
							0x55,0x07,0x05,0x00,0x00,0x00,0x00,0x00,0x00,
							0x16,0xff, //波特率自适应
							0x16,0x00,// 规约 未知
							0x51,0xe2,0x01,0x02,0x01, //端口 未知
							0x09,0x02,0x00,0x00,
							0x11,0x00,//费率个数 0
							0x11,0x00,
							0x16,0x01,
							0x12,0x08,0x98,
							0x12,0x00,0x0f,
						0x02,0x04,
							0x55,0x07,0x05,0x00,0x00,0x00,0x00,0x00,0x00,
							0x09,0x02,0x00,0x00,
							0x12,0x00,0x01,
							0x12,0x00,0x01,
						0x01,0x00
	                    };


//更新非固定长度的成员内容 适用于 DataType_bit_string  DataType_octet_string  DataType_visible_string,长度是不超过的256的。
//成功返回1 失败返回0 
//输入参数 u32 ADDR_Data,u32 Element,u32 SubElement,u32 LENmax_Data, 同 Get_ElementADDR(u32 ADDR_Data,u32 Element,u32 SubElement,u32 LENmax_Data);
//u32 New_data_addr,u32 New_data_len 成员新数据的地址和长度
u32 Update_ElementDATA_unfixed(u32 ADDR_Data,u32 Element,u32 SubElement,u32 LENmax_Data,u32 New_data_addr,u32 New_data_len)
{
	//新数据先存放到ADDR_128KDATABUFF+32K的地方
	u32 old_addr;
	u32 perupdate_datalen;//更新前,改成员的长度，包括数据类型那一字节的
	u32 perupdate_sumlen;//更新前整个结构的长度，用于判断更新后的总长是否会超出LENmax_Data
	u32 len;
//	u8 *p;
	u32 DataType;
	old_addr=Get_ElementADDR(ADDR_Data,Element,SubElement,LENmax_Data);//计算元素地址(实际地址),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
	if(old_addr==0)//要更新的成员地址不存在
	{
		return 1;
	}
	DataType=MRR(old_addr,1);
	perupdate_datalen=Get_DL698DataLen_S((u8 *)old_addr,LENmax_Data);
	perupdate_sumlen=Get_DL698DataLen_S((u8 *)ADDR_Data,LENmax_Data);
	if(New_data_len>(perupdate_datalen-1))//更新后的长度是增加的
	{
		if((New_data_len-(perupdate_datalen-1))>(LENmax_Data-perupdate_sumlen))//剩余字节不够用
		{
			return 1;
		}
	}
//	p=(u8 *)ADDR_128KDATABUFF+32*1024;
	MR(ADDR_128KDATABUFF+32*1024,ADDR_Data,old_addr-ADDR_Data+1);//先存插入点前的数据 + 插入点的数据类型那一位
	len=old_addr-ADDR_Data+1;
	if(DataType==DataType_TSA)//TSA特别 55 07 05 00 00 00 00 00 00 
	{
		MWR(New_data_len+1,ADDR_128KDATABUFF+32*1024+len,1);
		len+=1;
		MWR(New_data_len-1,ADDR_128KDATABUFF+32*1024+len,1);
		len+=1;
	}
	else if(DataType==DataType_array){//增加一组成员，成员不能是ARRAY 或 STRUCTUCE
		;
	}
	else
	{
		MWR(New_data_len,ADDR_128KDATABUFF+32*1024+len,1);
		len+=1;
	}
	MR(ADDR_128KDATABUFF+32*1024+len,New_data_addr,New_data_len);//存 更新的那些数据 
	len+=New_data_len;
	MR(ADDR_128KDATABUFF+32*1024+len,ADDR_Data+(old_addr-ADDR_Data)+perupdate_datalen,perupdate_sumlen-(old_addr-ADDR_Data)-perupdate_datalen);//补上更新点后不变成员的数据
	len+=(perupdate_sumlen-(old_addr-ADDR_Data)-perupdate_datalen);
	MW(ADDR_128KDATABUFF+32*1024,ADDR_Data,len);
	return 0;
}
//更新固定长度的成员内容 
//输入参数 u32 ADDR_Data,u32 Element,u32 SubElement,u32 LENmax_Data, 同 Get_ElementADDR(u32 ADDR_Data,u32 Element,u32 SubElement,u32 LENmax_Data);
//u64 New_data,u32 New_data_len
//成功返回1 失败返回0 
u32 Update_ElementDATA_fixed(u32 ADDR_Data,u32 Element,u32 SubElement,u32 LENmax_Data,u32 New_data_addr,u32 New_data_byte)
{
	u32 ret;
	ret=Get_ElementADDR(ADDR_Data,Element,SubElement,LENmax_Data);//计算元素地址(实际地址),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
	if(ret==0)//要更新的成员地址不存在
	{
		return 1;
	}
	MW(New_data_addr,ret+1,New_data_byte);
	return 0;
}

//-------------------------------------------------------------------------------------------------
// Function name:       Menu2_2_1_1_1
// Descriptions:        通信模式设置
// input parameters:    无
// output parameters:   无
// Returned value:      无
//-------------------------------------------------------------------------------------------------
void Menu2_2_1_1_1(void)
{
	u8 *p;
	u8 *p8;
	u16 *p16;
	u32 x;
	u32 i;
	u32 j;
	u32 k;
	u32 Ln;

#if (((Project/100)==3&&(USER/100)==5) || ((USER/100)==13) || ((USER/100)==11))//上海专变、黑龙江、吉林
	Ln=1;//菜单从第1行开始
#else
	Ln=0;//菜单从第0行开始
#endif

	switch(Stack->MenuStack[MenuCount->Count].Task)//菜单任务计数
	{
		case 0://任务0:初始化
			Stack->MenuStack[MenuCount->Count].Task=1;
			DisplayMenu(Stack->MenuStack[MenuCount->Count].MoveRow,(u8 *)pMenu2_2_1_1_1);//显示菜单
			//工作模式:混合模式（0），客户机模式（1），服务器模式（2）
			p8=Get_Element((u8*)ADDR_4500_2,1,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
		  if(p8)
			{
				DisplayString(Ln+1,10,0,(u8 *)WorkModeList[p8[1]&0x03]);
			}
		  //在线方式:永久在线（0），被动激活（1）
			p8=Get_Element((u8*)ADDR_4500_2,2,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
		  if(p8)
			{
				DisplayString(Ln+2,10,0,(u8 *)OnlineModeList[p8[1]&0x03]);
			}
		  //连接方式:TCP（0），UDP（1）
			p8=Get_Element((u8*)ADDR_4500_2,3,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
		  if(p8)
			{
				DisplayString(Ln+3,10,0,(u8 *)ConnectList[p8[1]&0x03]);
			}
		  //连接应用方式:主备模式（0），多连接模式（1）
			p8=Get_Element((u8*)ADDR_4500_2,4,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
		  if(p8)
			{
				DisplayString(Ln+4,10,0,(u8 *)ApplicationList[p8[1]&0x03]);
			}
		  //超时时间及重发次数：bit7~bit2：超时时间（秒）bit1~bit0：重发次数
			p8=Get_Element((u8*)ADDR_4500_2,11,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
		  if(p8)
			{
				//超时时间（秒）
				i=(p8[1]>>2);
				p=(u8*)ADDR_STRINGBUFF+(Ln+5)*84+4+10*2;
				bcd_p8(p,i,3);
				DisplayString(Ln+5,13,0,(u8 *)UnitList[9]);//0 s
				//重发次数
				i=(p8[1]&0x03);
				p=(u8*)ADDR_STRINGBUFF+(Ln+6)*84+4+10*2;
				bcd_p8(p,i,1);
				DisplayString(Ln+6,11,0,(u8 *)UnitList[10]);//1 次
			}
			//心跳周期(秒)  long-unsigned
			p8=Get_Element((u8*)ADDR_4500_2,12,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
		  if(p8)
			{
        		i=p8[1];
				i<<=8;
				i|=p8[2];
				p=(u8*)ADDR_STRINGBUFF+(Ln+7)*84+4+10*2;
				bcd_p8(p,i,5);
			  DisplayString(Ln+7,15,0,(u8 *)UnitList[9]);//0 s				
			}
			ArrowLR(Ln+Stack->MenuStack[MenuCount->Count].EditRow,18);//在Row行、Ln列显示左右箭头，同时清掉其他行的左右箭头
			MenuCount->v1=10;
			MenuCount->v2=17;
			NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
			break;
		case 1://任务1:选择
			for(j=0;j<2;j++)
			{
				if(Stack->MenuStack[MenuCount->Count].EditCol==0)
				{
					BoxSelect();
					if(Stack->MenuStack[MenuCount->Count].EditRow!=8)
					{
						DisplayString(Ln+8,6,0,"确认设置");
					}
					switch(Stack->MenuStack[MenuCount->Count].EditRow)
					{
						case 1://工作模式:混合模式（0），客户机模式（1），服务器模式（2）
							MenuCount->v1=10;
							MenuCount->v2=15;
							ArrowLR(Ln+Stack->MenuStack[MenuCount->Count].EditRow,18);//在Row行、Ln列显示左右箭头，同时清掉其他行的左右箭头
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 2://在线方式:永久在线（0），被动激活（1）
							MenuCount->v1=10;
							MenuCount->v2=17;
							ArrowLR(Ln+Stack->MenuStack[MenuCount->Count].EditRow,18);//在Row行、Ln列显示左右箭头，同时清掉其他行的左右箭头
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 3://连接方式:TCP（0），UDP（1）
							MenuCount->v1=10;
							MenuCount->v2=12;
							ArrowLR(Ln+Stack->MenuStack[MenuCount->Count].EditRow,18);//在Row行、Ln列显示左右箭头，同时清掉其他行的左右箭头
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 4://连接应用方式:主备模式（0），多连接模式（1）
							MenuCount->v1=10;
							MenuCount->v2=15;
							ArrowLR(Ln+Stack->MenuStack[MenuCount->Count].EditRow,18);//在Row行、Ln列显示左右箭头，同时清掉其他行的左右箭头
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 5://超时时间
							MenuCount->v1=10;
							MenuCount->v2=12;
							ArrowLR(Ln+Stack->MenuStack[MenuCount->Count].EditRow,18);//在Row行、Ln列显示左右箭头，同时清掉其他行的左右箭头
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 6://重发次数
							MenuCount->v1=10;
							MenuCount->v2=10;
							ArrowLR(Ln+Stack->MenuStack[MenuCount->Count].EditRow,18);//在Row行、Ln列显示左右箭头，同时清掉其他行的左右箭头
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 7://心跳周期(秒)  long-unsigned
							MenuCount->v1=10;
							MenuCount->v2=14;
							ArrowLR(Ln+Stack->MenuStack[MenuCount->Count].EditRow,18);//在Row行、Ln列显示左右箭头，同时清掉其他行的左右箭头
							NegativeLnMaxColMinCol(Stack->MenuStack[MenuCount->Count].EditRow,MenuCount->v2,MenuCount->v1);
							break;
						case 8:
							MenuCount->v1=0;
							for(k=0;k<10;k++)
							{
								if(k!=(Ln+Stack->MenuStack[MenuCount->Count].EditRow))
								{
									p16=(u16 *)(ADDR_STRINGBUFF+k*84+4+16*2);
									if((p16[2]&0x7fff)==32 && (p16[3]&0x7fff)==33)
									{
										for(i=2;i<=3;i++)
										{
											p16[i]=(p16[i]&0x8000)+0x2020;
										}
									}
								}
							}
							MenuNegative(Stack->MenuStack[MenuCount->Count].EditRow);
							break;
						default:
							break;
					}
					if((Comm_Ram->ButtonVal&0x08)!=0)
					{//右键
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 1://工作模式:混合模式（0），客户机模式（1），服务器模式（2）
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								switch(p8[0])
								{
									case 0x46://混
										i=1;
										break;
									case 0xF8://客
										i=2;
										break;
									case 0x7A://服
										i=0;
										break;
								}
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,10,0,(u8 *)WorkModeList[i]);
								break;
							case 2://在线方式:永久在线（0），被动激活（1）
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								switch(p8[0])
								{
									case 0x8E://永
										i=1;
										break;
									case 0x8C://被
										i=0;
										break;
								}
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,10,0,(u8 *)OnlineModeList[i]);//1 永久在线 2 被动激活 3 时段在线
								break;
							case 3://连接方式:TCP（0），UDP（1）
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								switch(p8[0])
								{
									case 0x54://TCP
										i=1;
										break;
									case 0x55://UDP
										i=0;
										break;
								}
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,10,0,(u8 *)ConnectList[i]);
								break;
							case 4://连接应用方式:主备模式（0），多连接模式（1）
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								switch(p8[0])
								{
									case 0x30://主
										i=1;
										break;
									case 0x82://多
										i=0;
										break;
								}
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,10,0,(u8 *)ApplicationList[i]);
								break;
							case 5://超时时间
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,3);
								if(x<63)
								{
									p8_add1(p8,3);
								}
								else
								{
									bcd_p8(p8,0,3);
								}
								break;
							case 6://重发次数
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,1);
								if(x<3)
								{
									p8_add1(p8,1);
								}
								else
								{
									bcd_p8(p8,0,1);
								}
								break;
							case 7://心跳周期(秒)  long-unsigned
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,5);
								if(x<65535)
								{
									p8_add1(p8,5);
								}
								else
								{
									bcd_p8(p8,0,5);
								}
								break;
							default:
								break;
						}
					}
					if((Comm_Ram->ButtonVal&0x04)!=0)
					{//左键
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 1://工作模式:混合模式（0），客户机模式（1），服务器模式（2）
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								switch(p8[0])
								{
									case 0x46://混
										i=2;
										break;
									case 0xF8://客
										i=0;
										break;
									case 0x7A://服
										i=1;
										break;
								}
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,10,0,(u8 *)WorkModeList[i]);
								break;
							case 2://在线方式:永久在线（0），被动激活（1）
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								switch(p8[0])
								{
									case 0x8E://永
										i=1;
										break;
									case 0x8C://被
										i=0;
										break;
								}
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,10,0,(u8 *)OnlineModeList[i]);//1 永久在线 2 被动激活 3 时段在线
								break;
							case 3://连接方式:TCP（0），UDP（1）
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								switch(p8[0])
								{
									case 0x54://TCP
										i=1;
										break;
									case 0x55://UDP
										i=0;
										break;
								}
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,10,0,(u8 *)ConnectList[i]);
								break;
							case 4://连接应用方式:主备模式（0），多连接模式（1）
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								switch(p8[0])
								{
									case 0x30://主
										i=1;
										break;
									case 0x82://多
										i=0;
										break;
								}
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,10,0,(u8 *)ApplicationList[i]);
								break;
							case 5://超时时间
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,3);
								if(x>0)
								{
									p8_sub1(p8,3);
								}
								else
								{
									bcd_p8(p8,63,3);
								}
								break;
							case 6://重发次数
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,1);
								if(x>0)
								{
									p8_sub1(p8,1);
								}
								else
								{
									bcd_p8(p8,3,1);
								}
								break;
							case 7://心跳周期(秒)  long-unsigned
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,5);
								if(x>0)
								{
									p8_sub1(p8,5);
								}
								else
								{
									bcd_p8(p8,65535,5);
								}
								break;
							default:
								break;
						}
					}
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 5://超时时间
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 6://重发次数
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 7://心跳周期(秒)  long-unsigned
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 8://确认设置
								DisplayClrRow_4(Ln+Stack->MenuStack[MenuCount->Count].EditRow);//清屏幕显示的指定行(4个控制字不清)
								DisplayString(Ln+Stack->MenuStack[MenuCount->Count].EditRow,9,0,"OK");
								//保存设置的数据
								//1.工作模式:混合模式（0），客户机模式（1），服务器模式（2）
								x=Get_ElementADDR(ADDR_4500_2,1,0,LENmax_4500_2);//计算元素地址(实际逻辑地址),使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
								if(x)
								{
									p8=(u8 *)(ADDR_STRINGBUFF+(Ln+1)*84+4+10*2);
									switch(p8[0])
									{
										case 0x46://混
											i=0;
											break;
										case 0xF8://客
											i=0x01;
											break;
										case 0x7A://服
											i=0x02;
											break;
										default:
											break;
									}
									MWR(i,x+1,1);
								}
								
								//2.在线方式:永久在线（0），被动激活（1）
								x=Get_ElementADDR(ADDR_4500_2,2,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
								if(x)
								{
									p8=(u8*)ADDR_STRINGBUFF+(Ln+2)*84+4+10*2;
									switch(p8[0])
									{
										case 0x8E://永
											i=0;
											break;
										case 0x8C://被
											i=0x01;
											break;
										default:
											break;
									}
									MWR(i,x+1,1);
								}
								//3.连接方式:TCP（0），UDP（1）
								x=Get_ElementADDR(ADDR_4500_2,3,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
								if(x)
								{
									p8=(u8*)ADDR_STRINGBUFF+(Ln+3)*84+4+10*2;
									switch(p8[0])
									{
										case 0x54://TCP
											i=0;
											break;
										case 0x55://UDP
											i=0x01;
											break;
									}
									MWR(i,x+1,1);
								}
								//4.连接应用方式:主备模式（0），多连接模式（1）
								x=Get_ElementADDR(ADDR_4500_2,4,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
								if(x)								
								{
									p8=(u8*)ADDR_STRINGBUFF+(Ln+4)*84+4+10*2;
									switch(p8[0])
									{
										case 0x30://主
											i=0;
											break;
										case 0x82://多
											i=0x01;
											break;
									}
									MWR(i,x+1,1);									
								}
								//5.超时时间及重发次数：bit7~bit2：超时时间（秒）bit1~bit0：重发次数
								x=Get_ElementADDR(ADDR_4500_2,11,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
								if(x)
								{
									//超时时间（秒）
									p8=(u8*)ADDR_STRINGBUFF+(Ln+5)*84+4+10*2;
									i=p8_bcd(p8,3);
									i<<=2;
									//重发次数
									p8=(u8*)ADDR_STRINGBUFF+(Ln+6)*84+4+10*2;
									k=p8_bcd(p8,1);
									i|=k;
									MWR(i,x+1,1);									
								}
								//7.心跳周期(秒)  long-unsigned
								x=Get_ElementADDR(ADDR_4500_2,12,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
								if(x)
								{
									p8=(u8*)ADDR_STRINGBUFF+(Ln+7)*84+4+10*2;
									i=p8_bcd(p8,5);
									k=(i&0xff);
									k<<=8;
									k|=(i>>8);
									MWR(k,x+1,2);									
								}
								break;
							default:
								break;
						}
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
				else//if(Stack->MenuStack[MenuCount->Count].EditCol!=0)
				{
					Select(MenuCount->v2,MenuCount->v1);
					UpDownSelect();
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow)
						{
							case 5://超时时间
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,3);
								if(x>63)
								{
									bcd_p8(p8,0,3);
								}
								break;
							case 6://重发次数
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,1);
								if(x>3)
								{
									bcd_p8(p8,0,1);
								}
								break;
							case 7://7.心跳周期(秒)
								p16=(u16 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+16*2);
								p16[0]=0x2020;
								p16[1]=0x2020;
								p16[2]=32;//'左右箭头'
								p16[3]=33;
								p8=(u8 *)(ADDR_STRINGBUFF+(Ln+Stack->MenuStack[MenuCount->Count].EditRow)*84+4+10*2);
								x=p8_bcd(p8,5);
								if(x>65535)
								{
									bcd_p8(p8,0,5);
								}
								break;
							default:
								break;
						}
						Stack->MenuStack[MenuCount->Count].EditCol=0;
						Comm_Ram->ButtonVal&=~0x1F;//键使用后清0
					}
					else
					{
						Comm_Ram->ButtonVal&=~0x0F;//键使用后清0
						break;
					}
				}
			}
			if((Comm_Ram->ButtonVal&0x20)!=0)
			{//返回
				MenuDel();//返回上级菜单
			}
			Comm_Ram->ButtonVal&=~0x20;//键使用后清0
			break;
		default:
			break;
	}
}

