gdgly/NUC97X_JS/STM32F4xx/DL698/Menu_2_ParametersSetting.c
								}
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,8,0,(u8 *)PortList[i]);
								break;
							case 4:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+8*2);
								x=p8_bcd(p8,2);
								if(p8[0]==0xca&&p8[1]==0x5c)
								{//未知
									i=1;
								}
								else
								{
									switch(x)
									{
									case 64:
										x=p8_bcd(p8+8,2);
										if(x==19)
											i=2;
										if(x==20)
											i=3;
										break;
									case 69:
										i=4;
										break;
									case 18:
										i=0;
										break;
									default:
										break;
									}
									
								}
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,8,0,(u8 *)ProtocolList[i]);
								break;
							case 5:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+4*2);
								p8_add1(p8,12);
								break;
							case 6:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+6*2);
								p8_add1(p8,2);
								break;
							case 7:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+8*2);
								if(p8[0]==0xca&&p8[1]==0x5c)//未知
								{
									i=1;
								}
								else if(p8[0]==0x50&&p8[1]==0x4a)//单项
								{
									i=2;
								}
								else if(p8[8]==0xf4&&p8[9]==0x58)//三项三线
								{
									i=3;
								}
								else//三项四线
								{
									i=0;
								}
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,8,0,(u8 *)ConnectType[i]);
								break;
							case 8:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+6*2);
								p8_add1(p8,12);
								break;
							default:
								break;
						}
					}
					if((Comm_Ram->ButtonVal&0x04)!=0)
					{//左键
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1:
								p8=(u8 *)(ADDR_STRINGBUFF+1*84+4+8*2);
								x=p8_bcd(p8,4);
								if(x>1)
								{
									p8_sub1(p8,4);
								}
								else
								{
									bcd_p8(p8,(NUMmax_6000-1),4);
								}
								MenuCount->v3=p8_bcd(p8,4);
								Stack->MenuStack[MenuCount->Count].Task=0;
								break;
							case 2:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+8*2);
								x=p8_bcd(p8,2);
								if(p8[0]==0xa6&&p8[1]==0x63)
								{//自适应
									i=10;
								}
								else
								{
									switch(x)
									{
										case 30:
											i=11;
											break;
										case 60:
											i=0;
											break;
										case 12:
											i=1;
											break;
										case 24:
											i=2;
											break;
										case 48:
											i=3;
											break;
										case 72:
											i=4;
											break;
										case 96:
											i=5;
											break;
										case 19:
											i=6;
											break;
										case 38:
											i=7;
											break;
										case 57:
											i=8;
											break;
										case 11:
											i=9;
											break;
										default:
											break;
									}
								}
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,8,0,(u8 *)CommunicationSpeedList[i]);
								break;
							case 3:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+8*2);
								x=p8_bcd(p8,2);
								if(p8[0]==0xca&&p8[1]==0x5c)
								{//未知
									i=4;
								}
								else if(p8[0]==0x5c&&p8[1]==0x50)
								{//交采
									i=0;
								}
								else if(p8[0]==0x7a&&p8[1]==0x61)
								{//载波
									i=3;
								}
								else
								{
									switch(x)
									{
									case 48:
										x=p8_bcd(p8+8,1);
										if(x==1)
											i=1;
										if(x==2)
											i=2;
										break;
									default:
										break;
									}
								}
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,8,0,(u8 *)PortList[i]);
								break;
							case 4:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+8*2);
								x=p8_bcd(p8,2);
								if(p8[0]==0xca&&p8[1]==0x5c)
								{//未知
									i=4;
								}
								else
								{
									switch(x)
									{
									case 64:
										x=p8_bcd(p8+8,2);
										if(x==19)
											i=0;
										if(x==20)
											i=1;
										break;
									case 69:
										i=2;
										break;
									case 18:
										i=3;
										break;
									default:
										break;
									}
									
								}
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,8,0,(u8 *)ProtocolList[i]);
								break;
							case 5:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+4*2);
								p8_sub1(p8,12);
								break;
							case 6:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+6*2);
								p8_sub1(p8,2);
								break;
							case 7:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+8*2);
								if(p8[0]==0xca&&p8[1]==0x5c)//未知
								{
									i=3;
								}
								else if(p8[0]==0x50&&p8[1]==0x4a)//单项
								{
									i=0;
								}
								else if(p8[8]==0xf4&&p8[9]==0x58)//三项三线
								{
									i=1;
								}
								else//三项四线
								{
									i=2;
								}
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,8,0,(u8 *)ConnectType[i]);
								break;
							case 8:
								p8=(u8 *)(ADDR_STRINGBUFF+(Stack->MenuStack[MenuCount->Count].EditRow)*84+4+6*2);
								p8_sub1(p8,12);
								break;
							default:
								break;
						}
					}
					if((Comm_Ram->ButtonVal&0x10)!=0)
					{//确认
						switch(Stack->MenuStack[MenuCount->Count].EditRow+Stack->MenuStack[MenuCount->Count].MoveRow)
						{
							case 1:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 5:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 6:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,16,0,"输入");
								break;
							case 8:
								Stack->MenuStack[MenuCount->Count].EditCol=MenuCount->v1;
								DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,18,0,"输");
								break;
							case 9:
								DisplayClrRow_4(9);//清屏幕显示的指定行(4个控制字不清)
								p=(u8*)(ADDR_STRINGBUFF+(1-Stack->MenuStack[MenuCount->Count].MoveRow)*84+4+8*2);
								p8=(u8*)(ADDR_STRINGBUFF+1*84+4+8*2);
								x=p8_bcd(p8,4);
								if(x>NUMmax_6000)
								{//测量点超过最大值 则不可设置
									DisplayString(Stack->MenuStack[MenuCount->Count].EditRow,7,0,"无效测量点");
								}
								else
								{
									DisplayClrRow_4(9);//清屏幕显示的指定行(4个控制字不清)
									DisplayString(9,9,0,"OK");

									p8=(u8*)ADDR_DATABUFF+1024;
									MR(ADDR_DATABUFF+1024,ADDR_6000+LENper_6000*MenuCount->v3,LENper_6000);
									if(p8[0]==0)//如果本来不存在该配置序号，就应该是新加的，采用默认配置
									{
										MR(ADDR_DATABUFF+1024,(u32)default_6000,sizeof(default_6000));
									}
									else//存在，看下选择的序号和配置参数里的配置序号是否一致
									{
										p8=Get_Element((u8*)(ADDR_DATABUFF+1024),1,0,LENper_6000);
										k=p8[2]+p8[1]*0x100;
										if(k!=MenuCount->v3)
										{
											MR(ADDR_DATABUFF+1024,(u32)default_6000,sizeof(default_6000));
										}
									}
									
